
&НаКлиенте
Процедура ПрименитьСписокВыбора(Команда)
	Результат = Неопределено;
	Если Элементы.ГруппаТипыЗначений.ТекущаяСтраница = Элементы.ГруппаСтрока Тогда
		Результат = ЗначениеСтрока;
		
	ИначеЕсли Элементы.ГруппаТипыЗначений.ТекущаяСтраница = Элементы.ГруппаЧисло Тогда
		Результат = ЗначениеЧисло;
		
	Иначе
		Результат = ЗначениеСписок;

	КонецЕсли;

	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьИЗакрыть(Команда)
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ТипЗнч(Параметры.Значение) = Тип("Строка") Тогда
		Элементы.ГруппаТипыЗначений.ТекущаяСтраница = Элементы.ГруппаСтрока;
		Элементы.ГруппаЧисло.Видимость = Ложь;
		Элементы.ГруппаСписокЗначений.Видимость = Ложь;
		
		ЗначениеСтрока = Параметры.Значение;
		
	ИначеЕсли ТипЗнч(Параметры.Значение) = Тип("Число") Тогда
		Элементы.ГруппаТипыЗначений.ТекущаяСтраница = Элементы.ГруппаЧисло;
		Элементы.ГруппаСтрока.Видимость = Ложь;
		Элементы.ГруппаСписокЗначений.Видимость = Ложь;
		
		ЗначениеЧисло = Параметры.Значение;
		
	Иначе
		Элементы.ГруппаТипыЗначений.ТекущаяСтраница = Элементы.ГруппаСписокЗначений;
		Элементы.ГруппаСтрока.Видимость = Ложь;
		Элементы.ГруппаЧисло.Видимость = Ложь;
		
		ЗначениеСписок.ТипЗначения = Новый ОписаниеТипов(Параметры.ТипЗначенияСписка);
		Для Каждого Строка Из Параметры.Значение Цикл
			ЗначениеСписок.Добавить(Строка.Значение);
		
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Элементы.ГруппаТипыЗначений.ТекущаяСтраница = Элементы.ГруппаСтрока Тогда
		Элементы.ЗначениеСтрока.УстановитьГраницыВыделения(1, СтрДлина(ЗначениеСтрока) + 1);
		
	КонецЕсли;
КонецПроцедуры
