
&НаКлиенте
Процедура ДобавитьЭлементНаПрототип() Экспорт
	ДобавитьРеквизитНаСервере();
	
	
	ЭтаФорма.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьРеквизитНаСервере() 
	МассивДобавляемыхРеквизитов = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы("Реквизит1",Новый ОписаниеТипов("Строка"));
	НовыйРеквизит.Заголовок = "";
	НовыйРеквизит.СохраняемыеДанные = Ложь;	
	
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	ЭтаФорма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
	
	НовыйЭлемент = ЭтаФорма.Элементы.Вставить("Реквизит1", Тип("ПолеФормы"));
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "Реквизит1";	
	
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	ДобавитьЭлементНаПрототип();
	
КонецПроцедуры


&НаКлиенте
Функция ДобавитьПоле() Экспорт
	ДобавитьРеквизит();
	
	НовыйЭлемент = ЭтаФорма.Элементы.Добавить("РеквизитСтрока", Тип("ПолеФормы"), Неопределено);
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.ПутьКДанным = "РеквизитСтрока";
	
КонецФункции

&НаСервере
Функция ДобавитьРеквизит() 
	МассивДобавляемыхРеквизитов = Новый Массив;

	НовыйРеквизит = Новый РеквизитФормы("РеквизитСтрока", Новый ОписаниеТипов("Строка"));
	НовыйРеквизит.Заголовок = "Реквизит строка";
	НовыйРеквизит.СохраняемыеДанные = Ложь;
	
	МассивДобавляемыхРеквизитов.Добавить(НовыйРеквизит);
	
	
	
	
	//
	ЭтаФорма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);

КонецФункции
