
&НаКлиенте
Функция СохранитьФайл(РасположениеФайла, АдресФайлаВХранилище, Интерактивно, ОписаниеОповещения = Неопределено) Экспорт
	Если ОписаниеОповещения = Неопределено Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьФайлЗавершение", ЭтотОбъект);
		
	КонецЕсли;
	
	ПолучаемыеФайлы = Новый Массив;
	НовыйФайл = Новый ОписаниеПередаваемогоФайла(РасположениеФайла, АдресФайлаВХранилище);
	ПолучаемыеФайлы.Добавить(НовыйФайл);
	
	НачатьПолучениеФайлов(ОписаниеОповещения, ПолучаемыеФайлы,, Интерактивно);
	
КонецФункции

&НаКлиенте
Процедура СохранитьФайлЗавершение(ПолученныеФайлы, ДополнительныеПараметры) Экспорт
	// Заглушка	
КонецПроцедуры

&НаКлиенте
Функция ЗагрузитьФайл(РасположениеФайла, Интерактивно, ОписаниеОповещения) Экспорт
	НачатьПомещениеФайла(ОписаниеОповещения,, РасположениеФайла, Интерактивно);
	
КонецФункции
