
&НаКлиенте
Перем Проект;

// Возвращает в основную форму только то что нужно чтобы отобразить на форме...

&НаКлиенте
Функция Создать() Экспорт
	Проект = Новый Соответствие;

КонецФункции

&НаКлиенте
Функция ДобавитьФорму() Экспорт
	Результат = Новый Структура;

	Результат.Вставить("Форма", ПолучитьФорму("ВнешняяОбработка.Эскиз.Форма.Прототип"));
	Результат.Вставить("Свойства", Новый Структура);
	Результат.Вставить("Дочерние", Новый Соответствие);

	#Если _ Тогда
		Проект = Новый Соответствие; 
	#КонецЕсли
	
	Проект.Вставить("0", Результат);
	
	Возврат Результат;	
КонецФункции

&НаКлиенте
Функция ДобавитьГруппу() Экспорт
	
КонецФункции

&НаКлиенте
Функция ДобавитьПоле() Экспорт
	
КонецФункции

&НаКлиенте
Функция ДобавитьКнопку() Экспорт
	
КонецФункции

&НаКлиенте
Функция ДобавитьТаблицу() Экспорт
	
КонецФункции

&НаКлиенте
Функция ДобавитьДекорацию() Экспорт
	
КонецФункции

&НаКлиенте
Функция УдалитьФорму() Экспорт
	
КонецФункции

&НаКлиенте
Функция УдалитьЭлементУправления() Экспорт
	
КонецФункции

&НаКлиенте
Функция СделатьТекущим() Экспорт
	
КонецФункции

&НаКлиенте
Функция Загрузить(РасположениеПроекта) Экспорт
	Читатель = Новый ТекстовыйДокумент;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьЗавершение", ЭтотОбъект, Читатель);
	Читатель.НачатьЧтение(ОписаниеОповещения, РасположениеПроекта);
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьЗавершение(Читатель) Экспорт
	Десериализатор = Новый ЧтениеJSON;
	Десериализатор.УстановитьСтроку(Читатель.ПолучитьТекст());
	
	ИменаСвойствСоЗначениемТипаДата = Новый Массив;
	//ИменаСвойствСоЗначениемТипаДата.Добавить("");
	
	Проект = ПрочитатьJSON(Десериализатор, Истина, ИменаСвойствСоЗначениемТипаДата, ФорматДатыJSON.ISO);

КонецПроцедуры

&НаКлиенте
Функция Сохранить(РасположениеПроекта) Экспорт
	Сериализатор = Новый ЗаписьJSON;
	Сериализатор.ПроверятьСтруктуру = Истина;
	
	ПараметрыПисателя = Новый ПараметрыЗаписиJSON(, Символы.Таб,, ЭкранированиеСимволовJSON.СимволыВнеBMP);
	Сериализатор.УстановитьСтроку(ПараметрыПисателя);
	
	НастройкаСериализации = Новый НастройкиСериализацииJSON;
	НастройкаСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкаСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	ЗаписатьJSON(Сериализатор, Проект, НастройкаСериализации, "Преобразователь", ЭтотОбъект);
	
	Писатель = Новый ТекстовыйДокумент;
	Писатель.УстановитьТекст(Сериализатор.Закрыть());

	Писатель.НачатьЗапись(Неопределено, РасположениеПроекта);
	
КонецФункции

&НаКлиенте
Функция Преобразователь(Знач Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	Результат = Неопределено;
	
	Если ТипЗнч(Значение) = Тип("УправляемаяФорма") Тогда
		Результат = "";

	КонецЕсли;
	
	Возврат Результат;
КонецФункции
