
&НаКлиенте
Перем Проект;

// Возвращает в основную форму только то что нужно чтобы отобразить на форме...

&НаКлиенте
Функция Создать() Экспорт
	Результат = Новый Соответствие;

	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ДобавитьФорму() Экспорт
	Результат = Новый Структура;
	
	Результат.Вставить("Свойства", Новый Структура);
	Результат.Вставить("Элементы", Новый Соответствие);

	Проект.Вставить("0", Результат);
	
	Возврат Результат;	
КонецФункции

&НаКлиенте
Функция ДобавитьГруппу() Экспорт
	
КонецФункции

&НаКлиенте
Функция ДобавитьПоле() Экспорт
	
КонецФункции

&НаКлиенте
Функция ДобавитьКнопку() Экспорт
	
КонецФункции

&НаКлиенте
Функция ДобавитьТаблицу() Экспорт
	
КонецФункции

&НаКлиенте
Функция ДобавитьДекорацию() Экспорт
	
КонецФункции



&НаКлиенте
Функция Загрузить() Экспорт
	
КонецФункции

&НаКлиенте
Функция Сохранить() 
	
КонецФункции
