
&НаКлиенте
Перем Проект;

// Возвращает в основную форму только то что нужно чтобы отобразить на форме...

&НаКлиенте
Функция Создать() Экспорт
	Результат = Новый Соответствие;

	Возврат Результат;
КонецФункции

&НаКлиенте
Функция ДобавитьФорму() Экспорт
	Результат = Новый Структура;
	
	Результат.Вставить("Свойства", Новый Структура);
	Результат.Вставить("Элементы", Новый Соответствие);

	Проект.Вставить("0", Результат);
	
	Возврат Результат;	
КонецФункции

&НаКлиенте
Функция ДобавитьГруппу() Экспорт
	
КонецФункции

&НаКлиенте
Функция ДобавитьПоле() Экспорт
	
КонецФункции

&НаКлиенте
Функция ДобавитьКнопку() Экспорт
	
КонецФункции

&НаКлиенте
Функция ДобавитьТаблицу() Экспорт
	
КонецФункции

&НаКлиенте
Функция ДобавитьДекорацию() Экспорт
	
КонецФункции

&НаКлиенте
Функция УдалитьФорму() Экспорт
	
КонецФункции

&НаКлиенте
Функция УдалитьЭлементУправления() Экспорт
	
КонецФункции

&НаКлиенте
Функция СделатьТекущим() Экспорт
	
КонецФункции

&НаКлиенте
Функция Загрузить() Экспорт
	
КонецФункции

&НаКлиенте
Функция Сохранить(РасположениеПроекта) Экспорт
	Сериализатор = Новый ЗаписьJSON;
	Сериализатор.ПроверятьСтруктуру = Истина;
	
	ПараметрыПисателя = Новый ПараметрыЗаписиJSON(, Символы.Таб,, ЭкранированиеСимволовJSON.СимволыВнеBMP);
	Сериализатор.УстановитьСтроку(ПараметрыПисателя);
	
	НастройкаСериализации = Новый НастройкиСериализацииJSON;
	НастройкаСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкаСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	ЗаписатьJSON(Сериализатор, Проект, НастройкаСериализации);
	
	Писатель = Новый ТекстовыйДокумент;
	Писатель.УстановитьТекст(Сериализатор.Закрыть());

	Писатель.НачатьЗапись(Неопределено, РасположениеПроекта);
	
КонецФункции
