
#Область Переменные

&НаКлиенте
Перем Прототипы;

&НаКлиенте
Перем ВспомогательныеДанные;

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

&НаКлиенте
Процедура СоздатьПроект() Экспорт
	
	ВспомогательныеДанные = Новый Структура;
	ВспомогательныеДанные.Вставить("СчетчикФорм", 0);
	ВспомогательныеДанные.Вставить("СчетчикиЭлементовФорм", Новый Соответствие);
	
	Прототипы = Новый Соответствие;

КонецПроцедуры

&НаКлиенте
Функция ПолучитьВспомогательныеДанные() Экспорт
	
	Возврат ВспомогательныеДанные;
	
КонецФункции

&НаКлиенте
Процедура ЗагрузитьВспомогательныеДанные(ДанныеИзФайла) Экспорт
	
	ВспомогательныеДанные = ДанныеИзФайла;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьВсеФормы() Экспорт
	
	Для Каждого Форма Из Прототипы Цикл
		ТекущаяФорма = Прототипы.Получить(Форма.Ключ);
		Если ТекущаяФорма.Открыта() Тогда
			ТекущаяФорма.Закрыть();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрототип(ТекущиеДанные, РодительскаяФорма, Показать = Истина) Экспорт
	
	ТекущийПрототип = ПолучитьТекущийПрототип(ТекущиеДанные, РодительскаяФорма);
	Если Показать Тогда
		ТекущийПрототип.Открыть();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АктивизироватьТекущийЭлемент(Идентификатор, ИмяЭлемента) Экспорт
	
	ТекущийПрототип = Прототипы.Получить(Идентификатор);
	Если ТекущийПрототип.Открыта() Тогда
		ТекущийПрототип.Открыть();
		ТекущийПрототип.АктивизироватьТекущийЭлементУправления(ИмяЭлемента);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьНовоеИмяФормы() Экспорт
	
	ВспомогательныеДанные.СчетчикФорм = ВспомогательныеДанные.СчетчикФорм + 1;
	Результат = "Форма" + ВспомогательныеДанные.СчетчикФорм;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ПолучитьНовоеИмяЭлемента(ИмяФормы, ИмяЭлемента) Экспорт
	
	ТекущийСчетчик = ВспомогательныеДанные.СчетчикиЭлементовФорм[ИмяФормы];
	Если Не ТекущийСчетчик.Свойство(ИмяЭлемента) Тогда
		ТекущийСчетчик.Вставить(ИмяЭлемента, 0);
	КонецЕсли;
	
	ТекущийСчетчик[ИмяЭлемента] = ТекущийСчетчик[ИмяЭлемента] + 1;
	Результат = ИмяЭлемента + ТекущийСчетчик[ИмяЭлемента];
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ДобавитьЭлементУправления(СпециальныеСвойства, ТиповыеСвойства, Связать, Перемещение) Экспорт
	
	ТекущийПрототип = Прототипы.Получить(СпециальныеСвойства.Идентификатор);
	ТекущийПрототип.НарисоватьЭлементУправления(Тип(СпециальныеСвойства.Тип), СпециальныеСвойства, ТиповыеСвойства, Связать, Перемещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьЭлементУправления(ДанныеПеремещения) Экспорт
	
	ТекущийПрототип = Прототипы.Получить(ДанныеПеремещения.Идентификатор);
	ТекущийПрототип.ПереместитьЭлементУправления(ДанныеПеремещения);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФорму(Идентификатор) Экспорт
	
	ТекущийПрототип = Прототипы.Получить(Идентификатор);
	Если ТекущийПрототип.Открыта() Тогда
		ТекущийПрототип.Закрыть();
	КонецЕсли;
	
	Прототипы.Удалить(Идентификатор);
	ВспомогательныеДанные.СчетчикиЭлементовФорм.Удалить(Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЭлементУправления(Идентификатор, ИмяЭлемента, ИмяРеквизита, ЭтоКоманда, ЭтоКолонка = Ложь, ИмяТаблицы = "") Экспорт
	
	ТекущийПрототип = Прототипы.Получить(Идентификатор);
	ТекущийПрототип.СтеретьЭлементУправления(ИмяЭлемента, ИмяРеквизита, ЭтоКоманда, ЭтоКолонка, ИмяТаблицы);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьСвойство(Идентификатор, Свойство, Значение, ЭтоФорма = Истина, Элемент = "") Экспорт
	
	ТекущийПрототип = Прототипы.Получить(Идентификатор);
	ТекущийПрототип.ИзменитьСвойствоЭлементаУправления(Свойство, Значение, ЭтоФорма, Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИзменитьРеквизит(Идентификатор, СпециальныеСвойства) Экспорт
	
	ТекущийПрототип = Прототипы.Получить(Идентификатор);
	ТекущийПрототип.СоздатьИзменитьРеквизит(СпециальныеСвойства);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ПолучитьТекущийПрототип(ТекущиеДанные, РодительскаяФорма) 
	
	Результат = Прототипы.Получить(ТекущиеДанные.Идентификатор);
	Если Результат = Неопределено Тогда
		Результат = ПолучитьФорму("ВнешняяОбработка.Эскиз.Форма.Прототип",, РодительскаяФорма, ТекущиеДанные.Идентификатор);
		Результат.ЗакрыватьПриЗакрытииВладельца = Истина;
		Результат.Автозаголовок = Ложь;
		Результат.Заголовок = ТекущиеДанные.Заголовок;
		
		Прототипы.Вставить(ТекущиеДанные.Идентификатор, Результат);
		ВспомогательныеДанные.СчетчикиЭлементовФорм.Вставить(ТекущиеДанные.Идентификатор, Новый Структура);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
