
&НаКлиенте
Функция СохранитьФайл(РасположениеФайла, АдресФайлаВХранилище, Интерактивно, ОписаниеОповещения = Неопределено) Экспорт
	//ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьПроектЗавершение", ЭтотОбъект);
	//
	//ПолучаемыеФайлы = Новый Массив;
	//НовыйФайл = Новый ОписаниеПередаваемогоФайла(РасположениеФайла, АдресФайлаВХранилище);
	//ПолучаемыеФайлы.Добавить(НовыйФайл);
	//
	//НачатьПолучениеФайлов(ОписаниеОповещения, ПолучаемыеФайлы,, Интерактивно);
	//
КонецФункции

&НаКлиенте
Функция ЗагрузитьФайл() Экспорт
	//
КонецФункции
