
&НаКлиенте
Процедура ПолучитьМенеджерФайлов(Команда)
	Если ВерсияПлатформыСтаршеИлиРавнаТребуемойВерсии("8.3.15.0") Тогда
		МенеджерФайлов = ПолучитьФорму("ВнешняяОбработка.МенеджерФайлов.Форма.МенеджерФайлов_8_3_15");
		
	ИначеЕсли ВерсияПлатформыСтаршеИлиРавнаТребуемойВерсии("8.3.6.0") Тогда
		МенеджерФайлов = ПолучитьФорму("ВнешняяОбработка.МенеджерФайлов.Форма.МенеджерФайлов_8_3_6");
		
	Иначе
		ВызватьИсключение "Не удалось определить менеджер файлов.";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ВерсияПлатформыСтаршеИлиРавнаТребуемойВерсии(Знач ТребуемаяВерсия)
	Результат = Истина;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	ВерсияПлатформы = СистемнаяИнформация.ВерсияПриложения;
	
	КоличествоИтераций = 0;
	Пока Не КоличествоИтераций = 3 Цикл
		НомерПлатформы = Число(Лев(ВерсияПлатформы, Найти(ВерсияПлатформы, ".") - 1));
		НомерТребуемой = Число(Лев(ТребуемаяВерсия, Найти(ТребуемаяВерсия, ".") - 1));
		
		Если НомерПлатформы < НомерТребуемой Тогда
			Результат = Ложь;
			
			Прервать;
		КонецЕсли;

		ВерсияПлатформы = Сред(ВерсияПлатформы, Найти(ВерсияПлатформы, ".") + 1); 
		ТребуемаяВерсия = Сред(ТребуемаяВерсия, Найти(ТребуемаяВерсия, ".") + 1); 
		
		КоличествоИтераций = КоличествоИтераций + 1;
		
	КонецЦикла;

	Возврат Результат;
КонецФункции
