
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочитатьВходящиеПараметры(Параметры);
	ЗаполнитьПоУмолчанию();
	ЗаполнитьДеревоФормКонфигурации(); //ЗаполнитьСписокОбъектовКонфигурации();
	ПерейтиВРежимСоответствуюшийИсточникуФорм();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Элементы.ИсточникиФорм.ТекущаяСтраница = Элементы.ФормыИзПредприятия Тогда
		ЗаполнитьСписокОткрытыхФорм();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ОбъектыКонфигурации

&НаКлиенте
Процедура ОбъектыКонфигурацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПерейтиДалее();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ТипыОбъектовКонфигурации

&НаКлиенте
Процедура ТипыОбъектовКонфигурацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПерейтиДалее();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ФормыКонфгурации

&НаКлиенте
Процедура ФормыКонфгурацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Применить(Неопределено);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Применить(Команда)
	
	Результат = Неопределено;
	
	Если ИсточникФорм = ИсточникиФорм().ИзПредприятия Тогда
		ДанныеСтроки = Элементы.ОткрытыеФормы.ТекущиеДанные;
		Результат = ФормаИзОткрытогоОкна(ДанныеСтроки.ИдентификаторФормы);
	Иначе
		ДанныеСтрокиОбъект = Элементы.ОбъектыКонфигурации.ТекущиеДанные;
		ДанныеСтрокиТипОбъекта = Элементы.ТипыОбъектовКонфигурации.ТекущиеДанные;
		ДанныеСтрокиФорма = Элементы.ФормыКонфгурации.ТекущиеДанные;

		Результат = ФормаИзКонфигуратора(ДанныеСтрокиОбъект.ЗначениеОбъект, ДанныеСтрокиТипОбъекта.Значение, ДанныеСтрокиФорма.Значение);
	КонецЕсли;
	
	Закрыть(Результат);

КонецПроцедуры

&НаКлиенте
Процедура Отменить(Команда)
	
	Закрыть(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	
	ПерейтиДалее();
	
КонецПроцедуры

&НаКлиенте
Процедура Назад(Команда)
	
	ПерейтиНазад();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Загрузить входящие параметры.
// 
// Параметры:
//  Параметры - ДанныеФормыСтруктура - ожидаемые параметры:
//    * ИсточникФорм - Строка - см. ИсточникиФорм
&НаСервере
Процедура ПрочитатьВходящиеПараметры(Параметры);
	
	Параметры.Свойство("ИсточникФорм", ИсточникФорм);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоУмолчанию()
	
	Если Не ЗначениеЗаполнено(ИсточникФорм) Тогда
		ИсточникФорм = ИсточникиФорм().ИзПредприятия;
	КонецЕсли;

КонецПроцедуры

// Источники форм.
// 
// Возвращаемое значение:
//  - Фиксированная структура - источники форм для сканирования, со значениями
//    * ИзПредприятия - формы, открытые в режиме предприятия
//    * ИзКонфигуратора - формы конфигурации
&НаКлиентеНаСервереБезКонтекста
Функция ИсточникиФорм()
	
	ИсходнаяСтруктура = Новый Структура();
	ИсходнаяСтруктура.Вставить("ИзПредприятия", "ИзПредприятия");
	ИсходнаяСтруктура.Вставить("ИзКонфигуратора", "ИзКонфигуратора");
	
	Результат = Новый ФиксированнаяСтруктура(ИсходнаяСтруктура);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПерейтиВРежимСоответствуюшийИсточникуФорм()

	Если ИсточникФорм = ИсточникиФорм().ИзПредприятия Тогда
		Элементы.ИсточникиФорм.ТекущаяСтраница = Элементы.ФормыИзПредприятия;
	Иначе	
		Элементы.ИсточникиФорм.ТекущаяСтраница = Элементы.ФормыИзКонфигуратора;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСписокОткрытыхФорм()

	ОткрытыеОкна = ПолучитьОкна();
	Для Каждого ОткрытоеОкно Из ОткрытыеОкна Цикл
		НоваяСтрока = ОткрытыеФормы.Добавить();
		НоваяСтрока.Заголовок = ОткрытоеОкно.Заголовок;
		Если ОткрытоеОкно.Содержимое.Количество() Тогда
			НоваяСтрока.ИдентификаторФормы = ОткрытоеОкно.Содержимое[0].УникальныйИдентификатор;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура ЗаполнитьДеревоФормКонфигурации()
	
	ФормыКонфигурацииНаСервере = РеквизитФормыВЗначение("ФормыКонфигурации");
	
	Ключи = "Имя,Путь,Представление";
	
	ОписанияОбъектов = Новый Массив();
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"Справочники", "Справочник", "Справочники"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"Документы", "Документ", "Документы"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"Отчеты", "Отчет", "Отчеты"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"Обработки", "Обработка", "Обработки"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"ПланыВидовХарактеристик", "ПланВидовХарактеристик", "Планы видов характеристик"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"ПланыСчетов", "ПланСчетов", "Планы счетов"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"ПланыВидовРасчета", "ПланВидовРасчета", "Планы видов расчета"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"РегистрыСведений", "РегистрСведений", "Регистры сведений"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"РегистрыНакопления", "РегистрНакопления", "Регистры накопления"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"РегистрыБухгалтерии", "РегистрБухгалтерии", "Регистры бухгалтерии"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"РегистрыРасчета", "РегистрРасчета", "Регистры расчета"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"БизнесПроцессы", "БизнесПроцесс", "Бизнес-процессы"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"Задачи", "Задача", "Задачи"));
	
	Для Каждого ОписаниеОбъекта Из ОписанияОбъектов Цикл
		СтрокаТипОбъект = ФормыКонфигурацииНаСервере.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаТипОбъект, ОписаниеОбъекта);
		
		МетаданныеОбъектов = Метаданные[СтрокаТипОбъект.Имя];
		Для Каждого МетаданныеОбъекта Из МетаданныеОбъектов Цикл
			СтрокаОбъект = СтрокаТипОбъект.Строки.Добавить();
			СтрокаОбъект.Имя = МетаданныеОбъекта.Имя;
			СтрокаОбъект.Путь = МетаданныеОбъекта.Имя;
			СтрокаОбъект.Представление = МетаданныеОбъекта.Синоним;
			
			МетеданныеФормОбъекта = МетаданныеОбъектов[СтрокаОбъект.Имя].Формы;
			Для Каждого МетеданныеФормыОбъекта Из МетеданныеФормОбъекта Цикл
				СтрокаФормы = СтрокаОбъект.Строки.Добавить();
				СтрокаФормы.Имя = МетеданныеФормыОбъекта.Имя;
				СтрокаФормы.Путь = МетеданныеФормыОбъекта.Имя;
				СтрокаФормы.Представление = МетеданныеФормыОбъекта.Синоним;
				СтрокаФормы.ЭтоФорма = Истина;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ФормыКонфигурации, "ФормыКонфигурации");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСписокОбъектовКонфигурации()
	
	ОбъектыКонфигурацииНаСервере = РеквизитФормыВЗначение("ОбъектыКонфигурации");
	
	Ключи = "ИмяКонтейнера,ИмяОбъекта,Синоним";
	
	ОписанияОбъектов = Новый Массив();
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"Справочники", "Справочник", "Справочники"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"Документы", "Документ", "Документы"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"Отчеты", "Отчет", "Отчеты"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"Обработки", "Обработка", "Обработки"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"ПланыВидовХарактеристик", "ПланВидовХарактеристик", "Планы видов характеристик"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"ПланыСчетов", "ПланСчетов", "Планы счетов"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"ПланыВидовРасчета", "ПланВидовРасчета", "Планы видов расчета"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"РегистрыСведений", "РегистрСведений", "Регистры сведений"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"РегистрыНакопления", "РегистрНакопления", "Регистры накопления"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"РегистрыБухшалтерии", "РегистрБухгалтерии", "Регистры бухгалтерии"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"РегистрыРасчета", "РегистрРасчета", "Регистры расчета"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"БизнесПроцессы", "БизнесПроцесс", "Бизнес-процессы"));
	ОписанияОбъектов.Добавить(Новый Структура(Ключи,
		"Задачи", "Задача", "Задачи"));
	
	Для Каждого ОписаниеОбъекта Из ОписанияОбъектов Цикл
		НоваяСтрока = ОбъектыКонфигурацииНаСервере.Добавить();
		НоваяСтрока.Значение = ОписаниеОбъекта.ИмяКонтейнера;
		НоваяСтрока.ЗначениеОбъект = ОписаниеОбъекта.ИмяОбъекта;
		НоваяСтрока.Представление = ОписаниеОбъекта.Синоним;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ОбъектыКонфигурацииНаСервере, "ОбъектыКонфигурации");
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьТипыОбъектовКонфигурации(ИмяОбъектаКонфигурации)
	
	ТипыОбъектовКонфигурацииНаСервере = РеквизитФормыВЗначение("ТипыОбъектовКонфигурации");
	ТипыОбъектовКонфигурацииНаСервере.Очистить();
	
	Для Каждого МетаТипОбъект Из Метаданные[ИмяОбъектаКонфигурации] Цикл
		НоваяСтрока = ТипыОбъектовКонфигурацииНаСервере.Добавить();
		НоваяСтрока.Значение = МетаТипОбъект.Имя;
		НоваяСтрока.Представление = МетаТипОбъект.Синоним;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТипыОбъектовКонфигурацииНаСервере, "ТипыОбъектовКонфигурации");
	
КонецПроцедуры

&НаСервере
Процедура ПерезаполнитьФормыКонфигурации(ИмяОбъектаКонфигурации, ИмяТипаОбъектаКонфигурации)
	
	ФормыКонфгурацииНаСервере = РеквизитФормыВЗначение("ФормыКонфгурации");
	ФормыКонфгурацииНаСервере.Очистить();
	
	Для Каждого МетаФорма Из Метаданные[ИмяОбъектаКонфигурации][ИмяТипаОбъектаКонфигурации].Формы Цикл
		НоваяСтрока = ФормыКонфгурацииНаСервере.Добавить();
		НоваяСтрока.Значение = МетаФорма.Имя;
		НоваяСтрока.Представление = МетаФорма.Синоним;
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ФормыКонфгурацииНаСервере, "ФормыКонфгурации");
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиДалее()
	
	Если Элементы.ЭтапыВыбораФормыКонфигурации.ТекущаяСтраница = Элементы.ЭтапВыбораОбъектаКонфигурации Тогда
		ДанныеСтроки = Элементы.ОбъектыКонфигурации.ТекущиеДанные;
		ПерезаполнитьТипыОбъектовКонфигурации(ДанныеСтроки.Значение);
		
		Элементы.ЭтапыВыбораФормыКонфигурации.ТекущаяСтраница = Элементы.ЭтапВыбораТипаОбъектаКонфиграции;
	ИначеЕсли Элементы.ЭтапыВыбораФормыКонфигурации.ТекущаяСтраница = Элементы.ЭтапВыбораТипаОбъектаКонфиграции Тогда
		ДанныеСтрокиОбъекта = Элементы.ОбъектыКонфигурации.ТекущиеДанные;
		ДанныеСтрокиТипаОбъекта = Элементы.ТипыОбъектовКонфигурации.ТекущиеДанные;
		ПерезаполнитьФормыКонфигурации(ДанныеСтрокиОбъекта.Значение, ДанныеСтрокиТипаОбъекта.Значение);
		Элементы.ЭтапыВыбораФормыКонфигурации.ТекущаяСтраница = Элементы.ЭтапВыбораФормы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиНазад()
	
	Если Элементы.ЭтапыВыбораФормыКонфигурации.ТекущаяСтраница = Элементы.ЭтапВыбораФормы Тогда
		Элементы.ЭтапыВыбораФормыКонфигурации.ТекущаяСтраница = Элементы.ЭтапВыбораТипаОбъектаКонфиграции;
	ИначеЕсли Элементы.ЭтапыВыбораФормыКонфигурации.ТекущаяСтраница = Элементы.ЭтапВыбораТипаОбъектаКонфиграции Тогда
		Элементы.ЭтапыВыбораФормыКонфигурации.ТекущаяСтраница = Элементы.ЭтапВыбораОбъектаКонфигурации;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция ФормаИзОткрытогоОкна(ИдентификаторФормы)
	
	Результат = Неопределено;
	
	ОткрытыеОкна = ПолучитьОкна();
	Для Каждого ОткрытоеОкно Из ОткрытыеОкна Цикл
		Если ОткрытоеОкно.Содержимое.Количество() 
			И ИдентификаторФормы = Строка(ОткрытоеОкно.Содержимое[0].УникальныйИдентификатор) Тогда
			
			Результат = ОткрытоеОкно.Содержимое[0];
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ФормаИзКонфигуратора(ИмяОбъекта, ИмяТипаОбъекта, ИмяФормы)
	
	Результат = Неопределено;
	
	ПолноеИмяФормы = СтрШаблон("%1.%2.Форма.%3", ИмяОбъекта, ИмяТипаОбъекта, ИмяФормы);
	Результат = ПолучитьФорму(ПолноеИмяФормы);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
