
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ВыборОткрытойФормы") Тогда
		Элементы.ИсточникиФорм.ТекущаяСтраница = Элементы.ФормыИзПредприятия;
	Иначе	
		Элементы.ИсточникиФорм.ТекущаяСтраница = Элементы.ФормыИзКонфигуратора;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Элементы.ИсточникиФорм.ТекущаяСтраница = Элементы.ФормыИзПредприятия Тогда
		ОткрытыеОкна = ПолучитьОкна();
		Для Каждого ОткрытоеОкно Из ОткрытыеОкна Цикл
			НоваяСтрока = ОткрытыеФормы.Добавить();
			НоваяСтрока.Заголовок = ОткрытоеОкно.Заголовок;
			Если ОткрытоеОкно.Содержимое.Количество() Тогда
				НоваяСтрока.ИдентификаторФормы = ОткрытоеОкно.Содержимое[0].УникальныйИдентификатор;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;


КонецПроцедуры

&НаКлиенте
Процедура Применить(Команда)
	
	ДанныеСтроки = Элементы.ОткрытыеФормы.ТекущиеДанные;
	
	ИскомаяФорма = Неопределено;
	
	ОткрытыеОкна = ПолучитьОкна();
	Для Каждого ОткрытоеОкно Из ОткрытыеОкна Цикл
		Если ОткрытоеОкно.Содержимое.Количество() 
			И ДанныеСтроки.ИдентификаторФормы = Строка(ОткрытоеОкно.Содержимое[0].УникальныйИдентификатор) Тогда
			
			ИскомаяФорма = ОткрытоеОкно.Содержимое[0];
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Закрыть(ИскомаяФорма);

КонецПроцедуры



