
&НаКлиенте
Функция СохранитьФайл(ОписаниеОповещения, РасположениеФайла, АдресФайлаВХранилище, Интерактивно) Экспорт
	//ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьПроектЗавершение", ЭтотОбъект);
	
	ПолучаемыеФайлы = Новый Массив;
	НовыйФайл = Новый ОписаниеПередаваемогоФайла(РасположениеФайла, АдресФайлаВХранилище);
	ПолучаемыеФайлы.Добавить(НовыйФайл);
	
	НачатьПолучениеФайлов(ОписаниеОповещения, ПолучаемыеФайлы,, Интерактивно);
	
КонецФункции


&НаКлиенте
Функция ЗагрузитьФайл() Экспорт
	
КонецФункции
