
&НаКлиенте
Перем Проект;

#Область Обработчики_событий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//---
	Проект = Новый Структура;

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПроект(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПроектЗавершение", ЭтотОбъект);
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПроектЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если Ложь
		Или ВыбранныеФайлы = Неопределено
		Или ВыбранныеФайлы.Количество() = 0
		Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Файл проекта не выбран.";
		Сообщение.Сообщить();	
		
		Возврат;
	КонецЕсли;
	
	РасположениеПроекта = ВыбранныеФайлы[0];
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроект(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	НачатьЗапускПриложения(Неопределено, РасположениеПроекта);

КонецПроцедуры

&НаКлиенте
Процедура СохранитьПроект(Команда)
	Если ПустаяСтрока(РасположениеПроекта) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьПроектЗавершение", ЭтотОбъект);
		
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогВыбораФайла.Расширение = "json";
		ДиалогВыбораФайла.Фильтр = "json|*.json";
		ДиалогВыбораФайла.Показать(ОписаниеОповещения);
		
	Иначе
		СохранитьПроектВФайл();
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПроектЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если Ложь
		Или ВыбранныеФайлы = Неопределено
		Или ВыбранныеФайлы.Количество() = 0
		Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Файл проекта не выбран.";
		Сообщение.Сообщить();	
		
		Возврат;
	КонецЕсли;
	
	РасположениеПроекта = ВыбранныеФайлы[0];
	
	СохранитьПроектВФайл();

КонецПроцедуры

#КонецОбласти

#Область Основная_функцональность

&НаКлиенте
Процедура СохранитьПроектВФайл() 
	// Я придумал! Основа (ядро) Эскиза - это ПРОЕКТ (тип - структура), он сериализуется в json а работа (интерактив) идет с помощью формы и её элементов.
	
	Читатель = Новый ЗаписьJSON;
	
	//Сериализатор
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПрототип(Имя)
	#Если _ Тогда
		Проект = Новый Структура;
	#КонецЕсли
	
	НовыйПрототип = ПолучитьФорму("ВнешняяОбработка.Эскиз.Форма.Прототип",, ЭтаФорма, Истина);
	НовыйПрототип.ЗакрыватьПриЗакрытииВладельца = Истина;
	
	Проект.Вставить(Имя, НовыйПрототип);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрототип(Имя)
	#Если _ Тогда
		Проект = Новый Структура;
	#КонецЕсли
	
	Проект[Имя].Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлементНаПрототип(Имя) 
	#Если _ Тогда
		Проект = Новый Структура;
	#КонецЕсли

	Проект[Имя].ДобавитьЭлементНаПрототип();

	
	
КонецПроцедуры

#КонецОбласти

#Область Подсказки
///////   РЕКВИЗИТЫ   //////////
//
//МассивДобавляемыхРеквизитов = Новый Массив;
//
//ЭтаФорма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
//
///////   КОМАНДЫ   //////////
//
///////   ЭЛЕМЕНТЫ   //////////
//
//// ******   Поле формы "Наименование"    ***********
//
//НовыйЭлемент = Этаформа.Элементы.Вставить("Наименование",Тип("ПолеФормы"),Неопределено,Неопределено);
//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
//НовыйЭлемент.ПутьКДанным = "Объект.Наименование";
//
//// ******   Поле формы "Код"    ***********
//
//НовыйЭлемент = Этаформа.Элементы.Вставить("Код",Тип("ПолеФормы"),Неопределено,ЭтаФорма.Элементы.Наименование);
//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
//НовыйЭлемент.ПутьКДанным = "Объект.Код";
//
//// ******   Группа формы "ФормаКоманднаяПанель"    ***********
//
//НовыйЭлемент = Этаформа.Элементы.Вставить("ФормаКоманднаяПанель",Тип("ГруппаФормы"),Неопределено,ЭтаФорма.Элементы.Код);
//НовыйЭлемент.Вид = ВидГруппыФормы.КоманднаяПанель;
#КонецОбласти


