
&НаКлиенте
Перем МенеджерПроекта;

#Область Обработчики_событий

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	МенеджерПроекта = ПолучитьФорму("ВнешняяОбработка.Эскиз.Форма.МенеджерПроекта");
	МенеджерПроекта.Создать();

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПроект(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПроектЗавершение", ЭтотОбъект);
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПроектЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если Ложь
		Или ВыбранныеФайлы = Неопределено
		Или ВыбранныеФайлы.Количество() = 0
		Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Файл проекта не выбран.";
		Сообщение.Сообщить();	
		
		Возврат;
	КонецЕсли;
	
	РасположениеПроекта = ВыбранныеФайлы[0];
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроект(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ОткрытьПроектЗавершение", ЭтотОбъект);
	НачатьЗапускПриложения(ОписаниеОповещения, РасположениеПроекта);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПроектЗавершение(КодВозврата, ДополнительныеПараметры) Экспорт
	//	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПроект(Команда)
	Если ПустаяСтрока(РасположениеПроекта) Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("СохранитьПроектЗавершение", ЭтотОбъект);
		
		ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
		ДиалогВыбораФайла.Расширение = "json";
		ДиалогВыбораФайла.Фильтр = "json|*.json";
		ДиалогВыбораФайла.Показать(ОписаниеОповещения);
		
	Иначе
		СохранитьПроектВФайл();
		
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьПроектЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	Если Ложь
		Или ВыбранныеФайлы = Неопределено
		Или ВыбранныеФайлы.Количество() = 0
		Тогда
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Файл проекта не выбран.";
		Сообщение.Сообщить();	
		
		Возврат;
	КонецЕсли;
	
	РасположениеПроекта = ВыбранныеФайлы[0];
	
	СохранитьПроектВФайл();

КонецПроцедуры

#КонецОбласти

#Область Основная_функцональность

&НаКлиенте
Процедура СохранитьПроектВФайл() 
	Сериализатор = Новый ЗаписьJSON;
	Сериализатор.ПроверятьСтруктуру = Истина;
	
	ПараметрыПисателя = Новый ПараметрыЗаписиJSON(, Символы.Таб,, ЭкранированиеСимволовJSON.СимволыВнеBMP);
	Сериализатор.УстановитьСтроку(ПараметрыПисателя);
	
	НастройкаСериализации = Новый НастройкиСериализацииJSON;
	НастройкаСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	НастройкаСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
	
	ЗаписатьJSON(Сериализатор, МенеджерПроекта, НастройкаСериализации);
	
	Писатель = Новый ТекстовыйДокумент;
	Писатель.УстановитьТекст(Сериализатор.Закрыть());

	Писатель.НачатьЗапись(Неопределено, РасположениеПроекта);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПрототип(Имя)
	#Если _ Тогда
		МенеджерПроекта = Новый Структура;
	#КонецЕсли
	
	НовыйПрототип = ПолучитьФорму("ВнешняяОбработка.Эскиз.Форма.Прототип",, ЭтаФорма, Истина);
	НовыйПрототип.ЗакрыватьПриЗакрытииВладельца = Истина;
	
	МенеджерПроекта.Вставить(Имя, НовыйПрототип);

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПрототип(Имя)
	#Если _ Тогда
		МенеджерПроекта = Новый Структура;
	#КонецЕсли
	
	МенеджерПроекта[Имя].Открыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьЭлементНаПрототип(Имя) 
	#Если _ Тогда
		МенеджерПроекта = Новый Структура;
	#КонецЕсли

	МенеджерПроекта[Имя].ДобавитьЭлементНаПрототип();

	
	
КонецПроцедуры

#КонецОбласти

#Область Подсказки
///////   РЕКВИЗИТЫ   //////////
//
//МассивДобавляемыхРеквизитов = Новый Массив;
//
//ЭтаФорма.ИзменитьРеквизиты(МассивДобавляемыхРеквизитов);
//
///////   КОМАНДЫ   //////////
//
///////   ЭЛЕМЕНТЫ   //////////
//
//// ******   Поле формы "Наименование"    ***********
//
//НовыйЭлемент = Этаформа.Элементы.Вставить("Наименование",Тип("ПолеФормы"),Неопределено,Неопределено);
//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
//НовыйЭлемент.ПутьКДанным = "Объект.Наименование";
//
//// ******   Поле формы "Код"    ***********
//
//НовыйЭлемент = Этаформа.Элементы.Вставить("Код",Тип("ПолеФормы"),Неопределено,ЭтаФорма.Элементы.Наименование);
//НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
//НовыйЭлемент.ПутьКДанным = "Объект.Код";
//
//// ******   Группа формы "ФормаКоманднаяПанель"    ***********
//
//НовыйЭлемент = Этаформа.Элементы.Вставить("ФормаКоманднаяПанель",Тип("ГруппаФормы"),Неопределено,ЭтаФорма.Элементы.Код);
//НовыйЭлемент.Вид = ВидГруппыФормы.КоманднаяПанель;
#КонецОбласти

&НаКлиенте
Процедура ДобавитьФорму(Команда)
	НоваяФорма = МенеджерПроекта.ДобавитьФорму();
	ОбновитьФормыИЭлементыУправления(НоваяФорма);
	//НоваяФорма = ПолучитьНовуюФорму();
	//ЗаполнитьНовуюФорму(НоваяФорма);
	//
	//ИмяНовойФормы = "Новая";
	//ЗапомнитьНовуюФорму(ИмяНовойФормы, НоваяФорма);
	//
	//ОписаниеФормы = Новый Структура;
	//ОписаниеФормы.Вставить("Свойства", Новый Структура);
	//ОписаниеФормы.Вставить("Элементы", Новый Соответствие);
	//
	//МенеджерПроекта.Вставить(ИмяНовойФормы, ОписаниеФормы);

КонецПроцедуры



&НаКлиенте
Функция ПолучитьНовуюФорму() 
	Результат = ПолучитьФорму("ВнешняяОбработка.Эскиз.Форма.Прототип",, ЭтаФорма, Истина);

	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ЗаполнитьНовуюФорму(НоваяФорма) 
	НоваяФорма.ЗакрыватьПриЗакрытииВладельца = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапомнитьНовуюФорму(ИмяНовойФормы, НоваяФорма) 
	Формы.Вставить(ИмяНовойФормы, НоваяФорма);
	
КонецПроцедуры
